TEST3/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     compInterFoam;

startFrom       latestTime;    // Avoid failing when only 0.orig exists
startTime       0;
stopAt          endTime;
endTime         2e-10;

deltaT          1e-15;         // Base time step (1 fs)
maxDeltaT       1e-14;         // Maximum: 2 fs (adaptive growth allowed)
minDeltaT       5e-16;         // Minimum: 0.05 fs (ultimate precision)
writeInterval   5e-14;         // Start with 1 ps intervals

// LASER TIMING - shorter pulse, longer observation
laserStartTime      0;
laserEndTime    2e-10;

maxThermalCourant 0.5;         // Increased from 0.02 - allow dt growth! // Reduced from 0.5 for thermal stability
thermalFluxRelax 0.15;          // Stronger damping of interface heat flux
maxCo           0.2;          // Increased from 0.02 - allow dt growth!  // Reduced from 0.5 for stability during thermal transitions
maxAlphaCo      0.2;         // Aggressive interface limit // Reduced from 0.5 interface limit for better interface tracking
maxDi           20;  // Limit interface dilation Courant number

verbose         true;
enableLiftProcessTracker true;

// ADAPTIVE OUTPUT - more frequent during active phase, less during cooling
adjustTimeStep  yes;           // ENABLE adaptive time stepping
writeControl    adjustableRunTime;

purgeWrite      100;            // Keep more time directories for analysis
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   8;             // Increased precision for longer runs
fileHandler     uncollated;

runTimeModifiable yes;

// EXTENDED PHASE-CHANGE - longer activation for complete process
phaseChangeCoeffs
{
    model               clausius_clapeyron;  // Not temperature window!
    Tvap                3560;     // K - FIXED: superheated liquid regime     // Not equilibrium boiling (3560K)
    Tsol                1941;     // K (melting point)
    hf                  9.1e6;   // J/kg (Ti vaporisation)
    gasConstant         [0 2 -2 -1 0 0 0] 174;    // J/kg/K (Ti vapor)
    p_ref               [1 -1 -2 0 0 0 0] 101325; // Pa at Tvap
 // Zhigilei: surface evaporation > 2000K // Will reach ~2200K at t ≈ 0.2ps (end of pulse)

    // Kinetic theory parameters
    evaporationCoeff       0.05;     // Change from 0.18 back to 0.03-0.06 range
    alphaMin              0.001;
    dtFloor             1e-15;         // Reduced for precision
    relaxationTime      1e-12;        // Faster response for femtosecond dynamics
    maxSource           [1 -1 -3 0 0 0 0] 1e22;   // Allow Hertz-Knudsen mass flux in fs LIFT regime
    minCoefficient      1e6;          // Reduced for gradual cooling
    onlyAboveVapor      false;
    metalFractionCutoff 1e-6;
    // EXTENDED ACTIVATION - through transfer and cooling
    activationTime      ((0 2e-10));  // Active through 50 ps femtosecond pulse window
}

// EXTENDED MASS TRANSFER - through solidification
massTransferCoeffs
{
    tStart  (0);
    tEnd    (2e-10);   // Active through 400 ps
    rateMax 3e13;      // Needed to ablate the 70 nm Ti film within ~200 ps (Piqué et al., Appl. Phys. A 79, 2004)
}

// LASER TIMING - shorter pulse, longer observation
laserStartTime      0;
laserEndTime    2e-10;

// Advanced interface capturing - TUNED FOR EXTENDED SIMULATION
useAdvancedInterfaceCapturing  true;

advancedInterfaceCapturing
{
    model               kinetic_theory;  // Not arbitrary scaling!
    stickingCoeff       1.0;
    momentumAccommodationCoeff       0.18;
    // CRITICAL FIX: Enable recoil in superheated liquid regime
    // Tvap = 2200K, start recoil at Tl > 1900K (just below melting)
    recoilTempOffset      0;            // Code requires non-negative value
                                        // Recoil starts at Tvap = 1941K (melting point) // Ultrafast regime: evaporation begins with melting
    phaseChangeTempOffset 0;
    // Mass flux threshold - CRITICAL FIX for mass transfer
    //pressureScale [1 -1 -2 0 0 0 0] 0.6;  // Knight momentum accommodation scaling

    massRateEps           1e-15;        // Do not zero-out low but physical fs evaporation flux
    // Knight (Phys. Rev. B 20, 1979) predicts recoil pressures exceeding
    // 0.3 GPa near 6000 K.  The fs deposition pushes Tl well beyond that, so
    // allow the kinetic-theory recoil driver to reach the multi-GPa recoil
    // levels observed in ultrafast LIFT experiments before clamping.

    clampRecoil           true;
    recoilMax             2.0e8;
    maxRecoilPressure   2.0e8;   // Clamp consistent with Feinaeugle et al. (Appl. Surf. Sci. 418, 2017)

    scaleRecoilMax        false;
    recoilRelax           0.7;
    alphaMin              0.001;
    //alphaMax              0.999;
    maxPhysicalTemperature 10000;
    // Physical limits
    // Keep the absolute bound consistent with the multi-GPa recoil required to
    // sustain fs-LIFT expulsion without premature pressure clamping.
        // PRESSURE RAMP/RELAXATION - prevents impulsive pressure surge
   // recoilRampSteps       200;         // Ramp over 200 timesteps
  //  recoilMaxDelta        1e8;         // Max pressure change per step: 100 MPa
   // recoilSmoothCoeff     0.2;         // Spatial smoothing coefficient
    //recoilSmoothIters     3;           // Number of smoothing iterations
}
logRecoilSuppression true;

// Temperature clamping - EXTENDED RANGE
enableTClamp    false;
minT            200;           // Allow cooling below room temp
maxT            10000;          // Keep within measured Ti plume temperatures (~10 kK)

// Two-temperature model properties - OPTIMIZED FOR EXTENDED RUNS
twoTemperatureProperties
{
    // Linear electronic heat capacity: Ce = γTe
    Ce
    {
        type        polynomial;
        value       0;
        coeffs
        (
            (0   0)  // Constant term = 0
            (630 1)  // Linear term: Ce = 630 · Te [J/m³/K²]
        );
    }
    
    // Temperature-dependent coupling
    G
    {
        type table;
        values
        (
            (300      1.0e18)   // ✓ CORRECT — Wellershoff (2000)
            (1000     3.0e18)   // ✓ CORRECT
            (2000     6.0e18)   // ✓ CORRECT
            (3000     1.0e19)   // ✓ CORRECT
            (5000     2.0e19)   // ✓ CORRECT
            (10000    5.0e19)   // ✓ CORRECT
            (20000    1.0e20)   // ✓ CORRECT
        );
    }
    
    Cl  [1 -1 -2 -1 0 0 0] 2.5e6;
    De  [0  2 -1  0 0 0 0] 1e-4;

    gasMetalExchangeCoeff
    {
        type        kapitza;    // Use acoustic mismatch model
        Z_metal     2.3e7;      // Ti acoustic impedance [Pa·s/m]
        Z_gas       383;        // Ar acoustic impedance [Pa·s/m]
        rho_metal   4500;       // Ti density [kg/m^3]
        rho_gas     1.7;        // Ar density [kg/m^3]
        maxTemperature 0;      // Optional cap [K] (0 => no cap)
    }
    gasMetalCutoffTemperature 2200;
    minMetalFractionForExchange 0.5;
    minGasMetalExchangeCoeff [1 -1 -3 -1 0 0 0] 1e6;
    maxGasMetalExchangeCoeff [1 -1 -3 -1 0 0 0] 5e8;
    maxGasMetalHeatFlux    5e8;
    minTe           200;
    maxTe           20000;      // Allow hot electrons
    maxTl           10000;       // Allow Ti lattice to exceed the ≈6.6 kK needed for 80 MPa recoil (Feinaeugle et al., Appl. Surf. Sci. 418, 2017)
    ambientTemperature 300;
    temperatureDifferenceFloor 10.0;                     // ← MISSING (causes singularities)
    // ADAPTIVE MICRO-STEPPING
    electronSubCycles        1;
    minElectronSubCycles     1;
    maxElectronSubCycles     20;     // Fine 2 nm cells need more electron micro-steps increased from 10 to 20
    maxElectronDeltaT        [0 0 1 0 0 0 0] 1e-15;  // Limit to 0.5 fs for stability //reduced from 1e-15 to 5e-16

    nInnerCouplingSweeps         2;  // More coupling iterations
    innerCouplingResidualTol     1e-3; // Enable convergence check
    
    klHighTThreshold 1000;
    klExponent       0.5;

    metalFractionFloor      1e-9;
    metalFractionCutoff     1e-6;
    metalAmbientBlendWidth  1e-3;
    CvolGasFloor            1e6;     // J/m³/K minimum for gas
    
    energyTolerance         0.02;    // Relaxed for long runs
    energyDiagnostics       false;
    temperatureDiagnostics  false;   // Reduce output volume
    energyAudit             false;
}

enhancedLIFTPhysics
{
    // Phase explosion and spinodal decomposition
    phaseExplosionCoeffs
    {
        enablePhaseExplosion   true;
        T_critical             9500;       // Ti critical temperature [K]
        T_spinodal             8550;       // 0.9 * T_critical [K]
        p_critical             1.2e8;      // Ti critical pressure [Pa]
        tau_explosion          1e-12;      // Explosion timescale [s]
        explosionMultiplier    100.0;      // Mass flux enhancement factor
    }
    // Plasma formation and ionization
    plasmaIonizationCoeffs
    {
        enablePlasmaModel      true;
        ionizationEnergy       1.093e-18;  // Ti: 6.82 eV = 1.093e-18 J
        T_ionization           30000;      // Ionization threshold [K]
        atomicMass             7.95e-26;   // Ti: 47.867 amu [kg]
        atomicNumberDensity    5.68e28;    // Ti: ~5.68e28 atoms/m^3
    }

    // Droplet/jet breakup (Weber number criterion)
    dropletBreakupCoeffs
    {
        enableDropletBreakup   true;
        We_critical            10.0;       // Critical Weber number
        minJetDiameter         1e-7;       // 100 nm [m]
        maxJetDiameter         10e-6;      // 10 μm [m]
        breakupTimeCoeff       1.0;        // Timescale coefficient
    }
}
// Clean monitoring functions
functions
{
    // Mid-plane visualization (optional)
    midPlaneVTK
    {
        type            surfaces;
        libs            ("libsampling.so");
        writeControl    writeTime;
        writeInterval   1;
        surfaceFormat   vtk;
        fields          (alpha.metal Tl Te T p_rgh U);

        surfaces
        (
            midPlane
            {
                type                cuttingPlane;
                planeType           pointAndNormal;
                pointAndNormalDict
                {
                    point   (25e-6 2.00357e-05 5e-6);
                    normal  (0 1 0);
                }
                interpolate         true;
            }
        );
    }
}
// ************************************************************************* //
