TEST3/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1e-6; // coordinates in micrometers

// CORRECTED LIFT GEOMETRY (bottom to top):
// y0 = 0.0000     - Substrate (receiver) bottom
// y1 = 8.0000     - Substrate top / Air gap bottom  
// y2 = 20.0000    - Air gap top / Ti film bottom
// y3 = 20.0714    - Ti film top (71.4 nm thick)

vertices
(
    // y0 = 0.0000 (substrate/receiver bottom)
    (0   0.0000  0)  (50  0.0000  0)  (50  0.0000 10)  (0   0.0000 10)
    
    // y1 = 8.0000 (substrate top / air gap bottom)
    (0   8.0000  0)  (50  8.0000  0)  (50  8.0000 10)  (0   8.0000 10)
    
    // y2 = 20.0000 (air gap top / Ti film bottom)
    (0  20.0000  0)  (50 20.0000  0)  (50 20.0000 10)  (0  20.0000 10)
    
    // y3 = 20.0714 (Ti film top) - 71.4 nm thick film
    (0  20.0714  0)  (50 20.0714  0)  (50 20.0714 10)  (0  20.0714 10)
);

blocks
(
    //                y-low face       y-high face        Nx   Ny   Nz   grading
    hex ( 0  3  2  1   4  7  6  5)   ( 20 100  10)  simpleGrading (1 1 0.5)  // Substrate (receiver) - reduced for quick validation

    hex ( 4  7  6  5   8 11 10  9)   ( 20 100  20)  simpleGrading (1 1 2.0)  // Air gap (12 µm) - reduced for quick validation

    // limit the y-resolution (global y = block k-direction) so neighbouring layers stay comparable

    // (matching the in-plane counts keeps the Ti mesh conformal to the air gap block)

    hex ( 8 11 10  9  12 15 14 13)   ( 20 100   9)  simpleGrading (1 1 0.67)  // Ti film (71.4 nm, thin layer) - reduced for quick validation
);
edges ();

boundary
(
    // Symmetry planes (external boundaries only)
    left          { type symmetryPlane; faces ((0 3 7 4)(4 7 11 8)(8 11 15 12)); }
    right         { type symmetryPlane; faces ((1 5 6 2)(5 9 10 6)(9 13 14 10)); }
    front         { type symmetryPlane; faces ((0 4 5 1)(4 8 9 5)(8 12 13 9)); }
    back          { type symmetryPlane; faces ((3 2 6 7)(7 6 10 11)(11 10 14 15)); }

    // CORRECTED: Substrate at bottom, donor wall at Ti film top
    substrate     { type wall;  faces ((0 3 2 1)); }      // BOTTOM - receiver substrate
    donor         { type wall;  faces ((12 15 14 13)); }   // TOP - transparent donor substrate
);

mergePatchPairs();

// ************************************************************************* //
