TEST3/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (metal air);

metal
{
    transportModel  Newtonian;
    // nu = mu/rho = 2.35e-3 / 4515 = 5.2e-7 (consistent with thermophysicalProperties)
    nu              nu [ 0 2 -1 0 0 0 0 ] 5.2e-7;
    rho             rho [ 1 -3 0 0 0 0 0 ] 4515;
}

air
{
    transportModel  Newtonian;
    // nu = mu/rho = 1.8e-5 / 1.2 = 1.5e-5 (consistent with thermophysicalProperties)
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.5e-5;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1.2;
}

sigma           sigma [1 0 -2 0 0 0 0] 1.64;

icAlpha         icAlpha [0 0 0 0 0 0 0] 0;
scAlpha         scAlpha [0 0 0 0 0 0 0] 0;

phaseChangeMaxSourceDefault phaseChangeMaxSourceDefault [1 -1 -3 0 0 0 0] 3e18;
// ************************************************************************* //
